{
  "locale": "en-US",
  "translations": {
    "ngb.alert.close": "Close",
    "ngb.timepicker.HH": "HH",
    "ngb.toast.close-aria": "Close",
    "ngb.pagination.first": "««",
    "ngb.datepicker.select-month": "Select month",
    "ngb.datepicker.previous-month": "Previous month",
    "ngb.progressbar.value": "{$INTERPOLATION}",
    "ngb.carousel.slide-number": " Slide {$INTERPOLATION} of {$INTERPOLATION_1} ",
    "ngb.timepicker.hours": "Hours",
    "ngb.pagination.previous": "«",
    "ngb.carousel.previous": "Previous",
    "ngb.timepicker.MM": "MM",
    "ngb.pagination.next": "»",
    "ngb.datepicker.select-year": "Select year",
    "ngb.datepicker.next-month": "Next month",
    "ngb.carousel.next": "Next",
    "ngb.timepicker.minutes": "Minutes",
    "ngb.pagination.last": "»»",
    "ngb.timepicker.increment-hours": "Increment hours",
    "ngb.pagination.first-aria": "First",
    "ngb.pagination.previous-aria": "Previous",
    "ngb.timepicker.decrement-hours": "Decrement hours",
    "ngb.pagination.next-aria": "Next",
    "ngb.timepicker.increment-minutes": "Increment minutes",
    "ngb.pagination.last-aria": "Last",
    "ngb.timepicker.decrement-minutes": "Decrement minutes",
    "ngb.timepicker.SS": "SS",
    "ngb.timepicker.seconds": "Seconds",
    "ngb.timepicker.increment-seconds": "Increment seconds",
    "ngb.timepicker.decrement-seconds": "Decrement seconds",
    "ngb.timepicker.PM": "{$INTERPOLATION}",
    "ngb.timepicker.AM": "{$INTERPOLATION}",
    "1982547114032807367": "Change Style",
    "6389087838012471451": "Welcome!!!",
    "8655209680827734721": "I'm Diego ",
    "407722552315847639": "I'm a Full stack developer with a strong focus in th e front",
    "4839309338424928166": "Technology stack",
    "9049849393230692879": "Laboral Experience",
    "8020402390620783618": "Education",
    "6515586072235899422": "Soft skills",
    "7922989125096435449": "Contact",
    "4900915828286562601": "Angular is my main development framework, and currently, it's the one I feel most confident with as I have been involved with it since 2017. I started with AngularJS and then learned and worked on projects with Angular 4. Later, I worked on mobile applications using Angular+Ionic. In recent years, I have been working on projects using Angular 11 and 14.",
    "5692392901960412560": "Spring is this framework to which I have a lot of affection and desire to work with again. My history with it is mainly between 2017 and mid-2019, it was one of the frameworks with which I started in the programming world, making a car insurance sales project, then a hospitality project, and finally a proxy service.",
    "2822477857438554991": "PostgreSQL was my first database in a job. I have created database models, stored procedures, and queries. I worked with this database for about 2 years between 2017 and 2019.",
    "6491843380723515267": "Git has been a tool I have been using since 2017 and nowadays, I cannot think of creating any project without using it. I have used Git with Bitbucket, Github and Gitlab, created repositories, new branches, followed a gitflow, made pull requests and merge requests, among many other comands that Git offers.",
    "7428505715967603354": "My history with Ionic started when I was working at Stefanini. The client I was working for was a company called Cardif, and they gave me the task of creating a proof of concept using Ionic, Firebase, Spring, and MongoDB. I developed a small application to explain to Cardif's management how push notifications work. This experience was one of the reasons why I was hired by Santander and Qintess. While working at Santander, I used this technology for two years until the app was removed from the marketplace.",
    "3336482812289488007": "I first learned Java in high school, and in university, I gained a deeper understanding of how it works and how to apply it in a professional setting. I learned about proper structure, best practices, design patterns, and database connections. When I worked for NW, I used the Spring framework. Later, at AlmaITS, I worked on a project without any framework, where I designed the database, created the database connection, and developed the microservice. I also worked on the frontend using JSF and Bootstrap. After that, I returned to working with Java and Spring at Stefanini.",
    "180290794087999715": "I worked with Jira when I was employed at Santander bank, which was a client of Qintess. Qintess provided some coaching to teach us how to use Jira and the Agile methodology, as the bank was transitioning to this new methodology, and our team was a part of this change. As a result, everyone in our team learned how to use Jira effectively.",
    "5630939976544161030": "I've been working with Bootstrap since I started working as a developer in NW. There is no company where I haven't used this library, and I have even used it for some tasks during my bachelor's studies. Also, I am using Bootstrap on this website =D",
    "5179503149075595850": "I have been honing my skills in Node.js for a considerable amount of time on my own. During my tenure at qintess, I got the chance to work with Node.js in a professional setting for under a year. My experience may be limited, but it has given me enough confidence, as Node.js shares similarities with Java and Angular among other well-known technologies.",
    "7305661690046510138": "While I don't have any professional experience working with React, I completed a comprehensive course where I gained a solid understanding of the framework. Through this course, I learned about React hooks, printing data, and making requests to APIs. I also had the opportunity to work on several projects that helped me develop my practical skills and put my knowledge into practice. Although I'm still in the process of honing my skills, I'm eager to continue learning and growing as a React developer."
  }
}